benchmarks/casesOF/2D/parasiticRipples/N800/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0 0);

boundaryField
{
    waterWall
    {
        type            slip;
    }
    topWall
    {
      type            pressureInletOutletVelocity;
      value           uniform (0 0 0);
      //type            slip;
      //type            fixedValue;
      //value           uniform (2.5 0 0);
    }
    sides1
    {
      type            empty;
      //type            cyclic;
    }
    sides2
    {
      type            empty;
      //type            cyclic;
    }
    inout1
    {
        type            cyclic;
    }
    inout2
    {
        type            cyclic;
    }
}


// ************************************************************************* //
