benchmarks/casesOF/2D/parasiticRipples/N800/system/curvatureDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      curvatureDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

curvatureModel mlpCurvature; //heightFunction //RDF //divGradAlpha

//SymMLP
mlpParams
{
  mlpModel "../../mlpCurvatureModels/SymMLP";
  interfaceTol 1e-3;
  zonalModel true;
  useScaling true;
  xoffsetInput 0;
  gainInput 2;
  yminInput -1;
  yminOutput 0.;
  gainOutput 1.0;
  xoffsetOutput 0.0;
}

//StdMLP
/*mlpParams
{
  mlpModel "../../mlpCurvatureModels/StdMLP";
  interfaceTol 1e-3;
  zonalModel false;
  useScaling false;
  }*/

//QLSZT2019
/*mlpParams
{
mlpModel "../../mlpCurvatureModels/QLSZT2019";
  interfaceTol 1e-3;
  zonalModel false;
  useScaling true;
  xoffsetInput 0;
  gainInput 2;
  yminInput -1;
  yminOutput -1;
  gainOutput 4.49775;
  xoffsetOutput -0.222333388916681;
  }*/


heightFunctionParams
{
  nMax 3;
}



// ************************************************************************* //
